<template>
  <v-container>
    <v-layout row>
      <v-flex xs12 sm6 offset-sm3>
        <h1 class="text--secondary mb-3 mt-3">My ads</h1>
        <v-card class="elevation-10 mb-5" v-for="ad in myAds" :key="ad.id">
          <v-layout row>
            <v-flex xs4 class="pl-3">
              <v-img :src="ad.src" height="175px"></v-img>
            </v-flex>
            <v-flex xs8 class="pr-3">
              <v-card-text>
                <h2 class="text--primary">{{ ad.title }}</h2>
                <p>{{ ad.desc }}</p>
              </v-card-text>
              <v-card-actions>
                <v-spacer></v-spacer>
                <v-btn color="primary" :to="'/ad/' + ad.id"> Open</v-btn>
              </v-card-actions>
            </v-flex>
          </v-layout>
        </v-card>
      </v-flex>
    </v-layout>
  </v-container>
</template>

<script>
export default {
  // data() {
  //   return {
  //     ads: [
  //       {
  //         title: "Караби",
  //         desc: "Средняя высота массива около 1000 м над уровнем моря, высшая точка гора Тай-Коба имеет высоту 1262 м. Площадь Караби-яйлы около 120 км², это самая обширная из крымских яйл. От соседних горных массивов Караби-яйлу с запада отделяют долины рек Суат и Бурульча, с востока — реки Тана-Су и Биюк-Карасу. Караби-яйла состоит из двух частей: большего по площади нижнего плато и расположенного на юго-западе верхнего плато, известного также под названием Кара-Тау.",
  //         promo: true,
  //         src: "https://64.media.tumblr.com/184c32f9137714fe83fbbeac7203ffd6/tumblr_pg8r7dmXRI1vtdgbmo2_1280.jpg",
  //         id: "1",
  //       },
  //       {
  //         title: "Чатырдаг",
  //         desc: "Принадлежит к Главной гряде Крымских гор. Ранее не был так отдалён от основной гряды, выделился в результате эрозии от Бабугана реками Улу-Узень и Альма, от Демерджи и Долгоруковской яйлы рекой Ангара. Состоит из нижнего и верхнего плато (яйлы). На верхнем плато расположены две вершины: восточная — Ангар-Бурун (1453 м) и западная — Эклизи-Бурун (1527 м). Длина плоскогорья с севера на юг — 10 километров, ширина с запада на восток — около 4 километров.",
  //         promo: true,
  //         src: "https://64.media.tumblr.com/3d46118960be0644209a279a385407d1/ccc72a237c25a059-87/s2048x3072/ef5ee9355ae7c99654a3ebbb0d8fa85cc1bdb16b.jpg",
  //         id: "2",
  //       },
  //       {
  //         title: "Караул-Оба",
  //         desc: "Гора в Крыму со сложной геоморфологической характеристикой. Обнаженная коническая вершина, отмеченная репером, находится в северной части, на юг от неё, через глубокую длинную седловину — платообразный массив со скальными стенами, гребнями, отломки; вблизи самого моря высятся зубцы утёсов.Гора является древним коралловым рифом высотой 341 м, сложенным крепким известняком органического происхождения.Южный отрог горы является мысом Чикен. На плато западного склона горного массива Караул-Оба расположены остатки боспорской крепости.",
  //         promo: true,
  //         src: "https://64.media.tumblr.com/bec8cd28670c5be8a3766600ae3e8f75/ccc72a237c25a059-ee/s2048x3072/e066fb18a6de6eed4c1b86407b386011039726b3.jpg",
  //         id: "3",
  //       },
  //       {
  //         title: "Северная Демерджи",
  //         desc: "Безлесная вершина, состоит из двух куполообразных поднятий высотой 1359 и 1356 г. Северо-западная часть выше. Репер установлен на вершине 1356 г. Северная Демерджи расположена на западном краю Демерджи-яйлы.",
  //         promo: true,
  //         src: "https://64.media.tumblr.com/198283b05cb8d8ad44a383212a380aff/ccc72a237c25a059-02/s2048x3072/4bf23819e9915459917dbf0a2c8bab75c94e2371.jpg",
  //         id: "4",
  //       },
  //     ],
  //   };
  // },
  computed: {
    myAds() {
      return this.$store.getters.myAds;
    },
  },
};
</script>
